todo-app/app/controllers/todos_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
INSERT INTO "todos" ("todo", "status", "priority", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["todo", "Learn English"], ["status", "f"], ["priority", 1], ["created_at", "2018-08-21 06:42:21.636382"], ["updated_at", "2018-08-21 06:42:21.636382"], ["user_id", 4]]
---
  def create
    @user = User.find(params[:user_id])
    # @todo = Todo.new(todo_params)
    @todo = @user.todos.create(todo_params)

UPDATE "todos" SET "todo" = $1, "updated_at" = $2 WHERE "todos"."id" = $3  [["todo", "Learn English"], ["updated_at", "2018-08-20 09:29:22.943943"], ["id", 980190962]]
---
  def update
    respond_to do |format|
      if @todo.update(todo_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "todos".* FROM "todos" WHERE "todos"."user_id" = ? AND "todos"."id" = ? LIMIT ?  [["user_id", 4], ["id", 7], ["LIMIT", 1]]
DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 3]]
---
  def destroy

    @user = User.find(params[:user_id])
    @todo = @user.todos.find(params[:id])
    @todo.destroy