todo-app/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "address", "phone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "khoibv"], ["address", "hanoi"], ["phone", "01222316836"], ["created_at", "2018-08-20 12:31:31.843412"], ["updated_at", "2018-08-20 12:31:31.843412"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "phone" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["phone", "123"], ["updated_at", "2018-08-22 03:47:20.836812"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)