booking/app/views/user_bookings/_form.html.erb

SELECT "locations".* FROM "locations"
---
    <%= form.label :location_id %>
    <%= collection_select(:user_booking, :location_id, Location.all, :id, :name, prompt: true) %>