booking/app/controllers/departments_controller.rb

  def create
    @department = Department.new(department_params)

    respond_to do |format|
      if @department.save
---
INSERT INTO "departments" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "OSD"], ["created_at", "2017-10-26 02:07:57.934699"], ["updated_at", "2017-10-26 02:07:57.934699"]]

    def set_department
      @department = Department.find(params[:id])
---
SELECT  "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]