booking/app/controllers/locations_controller.rb

  def create
    @location = Location.new(location_params)

    respond_to do |format|
      if @location.save
---
INSERT INTO "locations" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Training 1"], ["description", "Training room 1"], ["created_at", "2017-10-25 12:08:31.359383"], ["updated_at", "2017-10-25 12:08:31.359383"]]