booking/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "department_id", "email", "created_at", "updated_at", "login_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", "ABC user"], ["department_id", 2], ["email", "abc@mail.com"], ["created_at", "2017-10-26 02:32:34.953616"], ["updated_at", "2017-10-26 02:32:34.953616"], ["login_id", "abc"]]