booking/app/controllers/user_bookings_controller.rb

SELECT "user_bookings".* FROM "user_bookings"
---
  def index
    @user_bookings = UserBooking.all

INSERT INTO "user_bookings" ("from", "to", "created_at", "updated_at", "location_id") VALUES (?, ?, ?, ?, ?)  [["from", "2017-10-26 01:40:00"], ["to", "2017-10-26 01:40:00"], ["created_at", "2017-10-26 01:40:13.007920"], ["updated_at", "2017-10-26 01:40:13.007920"], ["location_id", 1]]
---
  def create
    @user_booking = UserBooking.new(user_booking_params)

    respond_to do |format|
      if @user_booking.save

UPDATE "user_bookings" SET "from" = ?, "to" = ?, "updated_at" = ? WHERE "user_bookings"."id" = ?  [["from", "2017-03-03 07:44:00"], ["to", "2017-10-25 17:44:00"], ["updated_at", "2017-10-25 11:23:42.604601"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @user_booking.update(user_booking_params)

DELETE FROM "user_bookings" WHERE "user_bookings"."id" = ?  [["id", 1]]
---
  def destroy
    @user_booking.destroy

SELECT  "user_bookings".* FROM "user_bookings" WHERE "user_bookings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_user_booking
      @user_booking = UserBooking.find(params[:id])