booking/app/views/users/_form.html.erb

      <div class="col-sm-9">
        <%= collection_select :user, :department_id, Department.all, :id, :name,
                              { prompt: true },
                              { :class => 'form-control' } %>
---
SELECT "departments".* FROM "departments"